#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ssh-key.random_pet.ssh_key_name: Refreshing state... [id=sshtruecollie]
data.azurerm_client_config.current: Reading...
module.resource-group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYTJhN2JlYy0zZDA4LTQxYWEtYTZmYy03ZjZjZmQ3M2NmYWQ7b2JqZWN0SWQ9OTJmNTgyZjQtOTE4ZC00YTRiLTgwNWItNjM2ZDZmODNiNTcyO3N1YnNjcmlwdGlvbklkPWI0MTY3NzA3LTE0ODYtNDAxYS1iYTliLWZiMGZiMDg0MTExNDt0ZW5hbnRJZD02YjdkM2ExZC00YmU2LTQxN2YtOTI5Zi0zN2IwMTE5YmE3OTk=]
module.user_assigned_identity.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks]
module.ssh-key.azapi_resource.ssh_public_key: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie]
module.network_contributor_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/c3f9c5c0-25fa-e3d2-abe3-b90e3097d89f]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks]
module.ssh-key.azapi_resource_action.ssh_public_key_gen: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshtruecollie/generateKeyPair]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/devacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/0747c87a-6db0-bb19-b7b2-9223cad42248]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/dev-velidaaks"
        name                                = "dev-velidaaks"
        tags                                = {
            "environment" = "dev"
            "owner"       = "willvelida"
        }
        # (36 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created
  + resource "azurerm_monitor_workspace" "workspace" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "dev-amw-velidaaks"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-velidaaks"
      + tags                                = {
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "australiaeast"
      + name                                   = "dev-grafana-velidaaks"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rg-velidaaks"
      + sku                                    = "Standard"
      + tags                                   = {
          + "environment" = "dev"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/b4167707-1486-401a-ba9b-fb0fb0841114/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dev-uai-velidaaks",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*